Tekla.Structures.AnalysisInternal.DotAnalysisLoadGroup
The serialization structure for AnalysisLoadGroup.

Tekla.Structures.AnalysisInternal.DotAnalysisLoadGroup._AnalysisObject
The analysis object.

Tekla.Structures.AnalysisInternal.DotAnalysisLoadGroup._LoadGroupID
The identifier of the load group.

Tekla.Structures.AnalysisInternal.DotAnalysisLoadGroup._Compatible
This indicates whether the load group is compatible.

Tekla.Structures.AnalysisInternal.DotAnalysisLoadGroup._Direction
The direction of the load group.

Tekla.Structures.AnalysisInternal.DotAnalysisLoadGroup._Incompatible
This indicates whether the load group is incompatible.

Tekla.Structures.AnalysisInternal.DotAnalysisLoadGroup._Name
The name of the load group.

Tekla.Structures.AnalysisInternal.DotAnalysisLoadGroup._Type
The type of the load group.

Tekla.Structures.AnalysisInternal.DotAnalysisLoadGroup.ToStruct(Tekla.Structures.Analysis.AnalysisLoadGroup)
DO NOT USE! For internal usage only!
P: P.

Tekla.Structures.AnalysisInternal.DotAnalysisLoadGroup.FromStruct(Tekla.Structures.Analysis.AnalysisLoadGroup)
DO NOT USE! For internal usage only!
P: P.